---
kind: property
id: P:Autodesk.Revit.DB.VertexIndexPairArray.Size
source: html/04376c6b-b9d8-87b9-d00c-404f5563e7f5.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.Size Property

Returns the number of VertexIndex pairs that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```